# IsApplied Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksharingDisplayGraphicSettings..::..IsApplied Property
WorksharingDisplayGraphicSettings Class See Also
---
Indicates whether this set of graphic overrides will be applied.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsApplied { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsApplied As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsApplied {
	bool get ();
}
```

# See Also
WorksharingDisplayGraphicSettings Class
Autodesk.Revit.DB Namespace